

# feature scaling

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv(r"C:\Users\USER\Downloads\preprocessing.csv")
df

   age  salary
0   20   10000
1   24   11000
2   28   12500
3   23   10500
4   32   15500

In [4]:
# standardization

In [5]:
from sklearn.preprocessing import StandardScaler

In [6]:
ss = StandardScaler()

In [7]:
ss.fit_transform(df)

array([[-1.29306549, -0.95720617],
       [-0.3352392 , -0.45341345],
       [ 0.62258709,  0.30227563],
       [-0.57469577, -0.70530981],
       [ 1.58041337,  1.8136538 ]])

In [8]:
# normalization

In [9]:
from sklearn.preprocessing import MinMaxScaler

In [10]:
ms = MinMaxScaler()

In [11]:
ms.fit_transform(df)

array([[0.        , 0.        ],
       [0.33333333, 0.18181818],
       [0.66666667, 0.45454545],
       [0.25      , 0.09090909],
       [1.        , 1.        ]])

# label encoding

In [12]:
df1 = pd.read_csv(r"C:\Users\USER\Downloads\encoding.csv")
df1

    name  age  gender      city
0    sam   28    male     delhi
1  alice   39  female  banglore
2  peter   24  female   chennai
3   manu   20    male     delhi

In [13]:
df1["gender"]

0      male
1    female
2    female
3      male
Name: gender, dtype: object

In [14]:
from sklearn.preprocessing import LabelEncoder

In [15]:
le = LabelEncoder()

In [16]:
le.fit_transform(df1["gender"])

array([1, 0, 0, 1])

In [17]:
df1["gender_encode"]=le.fit_transform(df1["gender"])
df1

    name  age  gender      city  gender_encode
0    sam   28    male     delhi              1
1  alice   39  female  banglore              0
2  peter   24  female   chennai              0
3   manu   20    male     delhi              1

In [18]:
le.fit_transform(df1["city"])

array([2, 0, 1, 2])

In [19]:
df1["city_encode"]=le.fit_transform(df1["city"])
df1

    name  age  gender      city  gender_encode  city_encode
0    sam   28    male     delhi              1            2
1  alice   39  female  banglore              0            0
2  peter   24  female   chennai              0            1
3   manu   20    male     delhi              1            2

# one hot encoding

In [20]:
data=pd.read_csv(r"C:\Users\USER\Downloads\city.csv")
data

  employee  Age         City
0        A   34  Ahammedabad
1        B   27     Banglore
2        C   27      Chennai
3        D   28  Ahammedabad
4        E   21  Ahammedabad
5        F   32      Chennai

In [21]:
from sklearn.preprocessing import LabelEncoder,LabelBinarizer

In [22]:
le = LabelEncoder()
lb = LabelBinarizer()

In [23]:
data['City']

0    Ahammedabad
1       Banglore
2        Chennai
3    Ahammedabad
4    Ahammedabad
5        Chennai
Name: City, dtype: object

In [24]:
le.fit_transform(data['City'])

array([0, 1, 2, 0, 0, 2])

In [25]:
data['City_lb'] = le.fit_transform(data['City'])
data

  employee  Age         City  City_lb
0        A   34  Ahammedabad        0
1        B   27     Banglore        1
2        C   27      Chennai        2
3        D   28  Ahammedabad        0
4        E   21  Ahammedabad        0
5        F   32      Chennai        2

In [26]:
City_one = lb.fit_transform(data['City_lb'])
City_one

array([[1, 0, 0],
       [0, 1, 0],
       [0, 0, 1],
       [1, 0, 0],
       [1, 0, 0],
       [0, 0, 1]])

In [33]:
 pd.DataFrame(City_one)

   0  1  2
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0
4  1  0  0
5  0  0  1

In [34]:
pd.concat([data, pd.DataFrame(City_one)],axis = 1)

  employee  Age         City  City_lb  0  1  2
0        A   34  Ahammedabad        0  1  0  0
1        B   27     Banglore        1  0  1  0
2        C   27      Chennai        2  0  0  1
3        D   28  Ahammedabad        0  1  0  0
4        E   21  Ahammedabad        0  1  0  0
5        F   32      Chennai        2  0  0  1